Билет14/Documents/РасходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>РасходнаяНакладная</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДолгиПоДокументам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПоДокументу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Билет14/AccumulationRegisters/ДолгиПоДокументам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>ДолгиПоДокументам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Нужен, чтобы блокировать не весь регистр, а только документы по одному контрагенту</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Билет14/Documents/РасходнаяНакладная/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Валюта", Валюта);
	ДанныеКурса = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(МоментВремени(), ПараметрыОтбора);
	Курс = ДанныеКурса.Курс;
	Если НЕ ЗначениеЗаполнено(Курс) Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указан курс валюты!";
		Сообщение.Сообщить();
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Движения.ДолгиПоДокументам.Записывать = Истина;
	Движения.ДолгиПоДокументам.Записать();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ДолгиПоДокументам");
	ЭлементБлокировки.УстановитьЗначение("Контрагент", Контрагент);
	ЭлементБлокировки.УстановитьЗначение("Документ", Документы.РасходнаяНакладная.ПустаяСсылка());
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДолгиПоДокументамОстатки.Документ КАК Документ,
		|	ПРЕДСТАВЛЕНИЕ(ДолгиПоДокументамОстатки.Документ.Валюта) КАК ВалютаПредставление,
		|	ДолгиПоДокументамОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ДолгиПоДокументам.Остатки(&МоментВремени, Контрагент = &Контрагент И Документ = ЗНАЧЕНИЕ(Документ.РасходнаяНакладная.ПустаяСсылка)) КАК ДолгиПоДокументамОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДолгиПоДокументамОстатки.Документ.МоментВремени";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("РоссийскийРубль", Справочники.Валюты.РоссийскийРубль);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		СуммаАванса = ВыборкаДетальныеЗаписи.СуммаОстаток;
		
	Иначе
		
		СуммаАванса = 0;
		
	КонецЕсли;
	
	СуммаДолгаВалюта = СуммаПоДокументу;
	Если СуммаАванса > 0 Тогда
		
		СуммаДолгаРубли = Окр(СуммаДолгаВалюта * Курс, 2); 
		
		СуммаКСписаниюРубли  = МИН(СуммаДолгаРубли, СуммаАванса);
		
		СуммаКСписаниюВалюта = ?(СуммаКСписаниюРубли = СуммаДолгаРубли, 
			СуммаДолгаВалюта,
			Окр(СуммаКСписаниюРубли / Курс, 2));
		
		Движение = Движения.ДолгиПоДокументам.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Валюта = Справочники.Валюты.РоссийскийРубль;
		Движение.Сумма = СуммаКСписаниюРубли;
		
		Движение = Движения.ДолгиПоДокументам.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Валюта = Валюта;
		Движение.Сумма = СуммаКСписаниюВалюта;
		
		Движение = Движения.ДолгиПоДокументам.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Валюта = Валюта;
		Движение.Сумма = СуммаКСписаниюВалюта;
		
		СуммаДолгаВалюта = СуммаДолгаВалюта - СуммаКСписаниюВалюта;
		
	КонецЕсли;
	
	Если СуммаДолгаВалюта > 0 Тогда	
		Движение = Движения.ДолгиПоДокументам.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Документ = Ссылка;
		Движение.Валюта = Валюта;
		Движение.Сумма = СуммаДолгаВалюта;
	КонецЕсли;
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
КонецПроцедуры
